// Задача 2. Напишите программу, которая на вход принимает два числа и выдает, какое большее, а какое меньшее.

// Console.Write("Введите первое число: ");
// int numberA = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int numberB = Convert.ToInt32(Console.ReadLine());
// if(numberA > numberB)
//     Console.WriteLine($"{numberA} больше {numberB}");
// else 
//     Console.WriteLine($"{numberB} больше {numberA}");



// Задача 4. Напишите программу, которая принимает на вход три числа и выдает максиальное из этих чисел.

// Console.Write("Введите первое число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int B = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int C = Convert.ToInt32(Console.ReadLine());
// if(A > B & A > C)
//     Console.WriteLine($"{A} больше всех");
// else if(A > B & A < C)
//     Console.WriteLine($"{C} больше всех");
// else if(A < B & A > C)
//     Console.WriteLine($"{B} больше всех");
// else if(A < B & A < C & B < C)
//     Console.WriteLine($"{C} больше всех");
// else
//     Console.WriteLine($"{B} больше всех");


// Задача 6. Напишите программу, которая на вход принимает число и выдает, является ли число четным.

// Console.Write("Введите число: ");
// int numberA = Convert.ToInt32(Console.ReadLine());
// if(numberA%2 == 0)
//     Console.WriteLine($"{numberA} четное");
// else 
//     Console.WriteLine($"{numberA} не четное");


// Задача 8. Напишите программу, которая на вход принимает число N, а на выходе показывает все четные числа от 1 до N.

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int count = 2;
// while (count <= number)
// {
//         if(count%2 == 0)
//         Console.Write(count+" ");
//         count++;
// }